[
 {
   "Name": "A Little Thing Called First Love",
   "Rating": 9.5,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "12/23/2019",
   "Date Completed": "12/28/2019",
   "Review": ""
 },
 {
   "Name": "A Love So Beautiful",
   "Rating": 10,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "05/04/2018",
   "Date Completed": "05/20/2018",
   "Review": ""
 },
 {
   "Name": "About Is Love",
   "Rating": 8.5,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "05/18/2019",
   "Review": ""
 },
 {
   "Name": "Accidentally in Love",
   "Rating": 10,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "11/22/2018",
   "Review": ""
 },
 {
   "Name": "Attention, Love!",
   "Rating": 9,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "11/03/2018",
   "Review": ""
 },
 {
   "Name": "Because of You",
   "Rating": 9.5,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "11/15/2019",
   "Date Completed": "11/30/2019",
   "Review": ""
 },
 {
   "Name": "Begin Again",
   "Rating": 8,
   "Romance & Chemistry": 1.5,
   "Story & Plot": 4.5,
   "Pathos & Production": 2,
   "Date Started": "12/19/2020",
   "Date Completed": "12/09/2020",
   "Review": "Romance: 1.5/2\nStory, Plot, Misunderstandings and Tropes: 4.5/6 (rounded)\nPathos: 2/2\nWould watch again?: 0/1\nOverall: 8/10\n\nHonestly, give this one a try! The chemistry is decent and the story is too!\n\nActing was so well done! I'm definitely going to keep watching the FL, Zhou Yu Tong, she was excellent.\n\nBut do be warned... the plot takes a dip around episode 25.\n\nThis drama had comedy, a sprinkle of drama, and a pretty even plot pace. I enjoyed the main couple and their story, but I definitely think it could've been altered so things didn't feel so \"off\" later on.\n\nThe second couple was also cute, but deserved more screen time! I hate when directors do that.\n\nIn terms of plot, I think they could've done better. It was strong until some drama occurred, and the reconciliation between the characters did not go as smooth as I thought it would. I didn't feel the chemistry come back 100%, if that makes sense. Looking at it chemistry wise, the FL was definitely awkward at first but she seemed to warm up as the drama continued. Other than that, their kid was adorable, and so were all of the scenes with him!\n\nAs I said in my headline, this one is good, but not one of the greats! Don't let its flaws keep you away ;)"
 },
 {
   "Name": "Behind Your Smile",
   "Rating": 10,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "05/24/2020",
   "Date Completed": "06/01/2020",
   "Review": ""
 },
 {
   "Name": "Boss & Me",
   "Rating": 9,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "11/04/2019",
   "Date Completed": "11/14/2019",
   "Review": ""
 },
 {
   "Name": "Count Your Lucky Stars",
   "Rating": 7.5,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "09/28/2020",
   "Review": ""
 },
 {
   "Name": "Find Yourself",
   "Rating": 7,
   "Romance & Chemistry": 2,
   "Story & Plot": 3,
   "Pathos & Production": 2,
   "Date Started": "04/21/2021",
   "Date Completed": "04/13/2021",
   "Review": "Romance: 2/2 \nStory, Plot, Misunderstandings and Tropes: 3/6 \nPathos: 2/2 \nWould watch again?: 0/1\nOverall: 7/10 \nActual: 7/10\n\nThis show has been on my list for well over a year, and it was very disappointing to see how it all went down. I was super excited to finally see a drama moving quickly (leads together within the first 10 or so eps!) but that was soon met with utter boredom and frustration as the episodes dragged on.\n\nOur leads did excellent regarding their scenes together and their chemistry, and a big shout out to Song Wei Long for doing such a great job at such a young age! That did make the drama a bit more tolerable later on. Additionally, there were so many well known actors and actresses that had roles in this drama, which made it all the more enjoyable when they came on screen.\n\nBut here's where everything seemed to go wrong in my view. In typical c-dramaland, our Second Lead and Female Lead tend to never *officially* be together. This drama decided to change that narrative. Our smart, sophisticated FL spent 1/2 of the drama dating one lead, and 1/2 the drama with the other - which was ridiculous and frustrating because she clearly never liked the second Male Lead. I thought her character was not as selfish as that. It was clear that the ML and FL still were not over each other, and to make matters worse it was clear she wasn't happy with the Second ML either. That was very off putting, and I ended up skipping most of their screen time in the second half.\n\nI did appreciate the humorous aspect to it, and those few laughs in the beginning (and throughout) really helped me keep watching. Also, the second couple was very cute, and so was the third. So I stayed for them. Overall, the only thing that brought the drama down in terms of its rating was the storyline. Everything else - from the sets to the costumes to makeup even - was flawless and well done.\n\nThis is definitely something for viewers who don't mind having 2 male leads (not a ML and a 2nd ML), and who don't mind seeing the FL visibly uncomfortable with who's she's dating for nearly 20 episodes."
 },
 {
   "Name": "Forever Love",
   "Rating": 9,
   "Romance & Chemistry": 1.5,
   "Story & Plot": 5.5,
   "Pathos & Production": 1.5,
   "Date Started": "2/17/2021",
   "Date Completed": "2/3/2021",
   "Review": "Romance: 1.5/2\nStory, Plot, Misunderstandings and Tropes: 5.5/6\nPathos: 1.5/2\nWould watch again?: 0/1\nOverall: 9/10\nActual: 8.5/10\n\nThis drama was a good one! Something that was perfect to get me over my drama slump. It was cute, cheesy and just adorable. I found myself saying \"aww\" every 10 seconds!\n\nWhat it lacked in continuity it had in seamless problem solving and few dramatic plot interruptions. I gave the story a 9/10 because it was chopped up at times, but overall I appreciate the writers choice to resolve things quickly.\n\nIt was filled to the brim with the usual tropes - opposing family, typical secondary couple pairings, etc - but was still quite an enjoyable watch!\n\nDefinitely wish there was more romantic interaction but given the FL's age, it's completely understandable why they held back. Will be looking out for more Wang An Yu - his acting was amazing!"
 },
 {
   "Name": "Gank Your Heart",
   "Rating": 9,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "03/01/2020",
   "Review": ""
 },
 {
   "Name": "Go Ahead",
   "Rating": 10,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "9/29/2020",
   "Date Completed": "10/17/2020",
   "Review": ""
 },
 {
   "Name": "Go Go Squid 2: Dt. Appledog's Time",
   "Rating": 6,
   "Romance & Chemistry": 2,
   "Story & Plot": 3,
   "Pathos & Production": 1,
   "Date Started": "",
   "Date Completed": "03/18/2021",
   "Review": "Romance: 2/2\nStory, Plot, Misunderstandings and Tropes: 3/6\nPathos & Production: 1/2\nWould watch again?: 0/1\nOverall: 5.5/10\nActual: 6/10\n\nIt didn't give what it was supposed to give\n\n*Sigh*\nI was really looking forward to this one.\n\nI rewatched Go-Go Squid just before I watched Dt. Appledog's time, and I wish I hadn't.\n\nIn short, it's no match for Go-Go Squid. My head hurts from how BORING it was. The plot was just okay. I was really hoping for more, but I think the original Go-Go Squid cast is what made it so GOOD. This cast just didn't have the same chemistry as the old one. The sets also didn't feel the same, KK headquarters felt... Cold? The GGS KK headquarters felt like home, but the set they chose to felt so empty.\n\nI was glad to see Hu Yi Tian finally saying sentences, and his chemistry with Li Yi Tong wasn't too bad either. I was rooting for them the whole time but couldn't bear to watch their story through.\n\nI think this drama might be interesting to people who have not seen Go Go Squid, but if you haven't seen it yet watch GGS first! Don't bother with this one :p"
 },
 {
   "Name": "Go Go Squid!",
   "Rating": 10,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "08/20/2019",
   "Review": ""
 },
 {
   "Name": "Hi Flower",
   "Rating": 7.5,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "",
   "Review": ""
 },
 {
   "Name": "I Hear You",
   "Rating": 8.5,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "07/10/2019",
   "Review": ""
 },
 {
   "Name": "Intense Love",
   "Rating": 10,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "06/09/2020",
   "Date Completed": "06/05/2020",
   "Review": ""
 },
 {
   "Name": "Le Coup de Foudre",
   "Rating": 10,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "06/21/2019",
   "Review": ""
 },
 {
   "Name": "Lost Romance",
   "Rating": 7.5,
   "Romance & Chemistry": 2,
   "Story & Plot": 3,
   "Pathos & Production": 2,
   "Date Started": "04/08/2021",
   "Date Completed": "04/12/2021",
   "Review": "Romance: 2/2 \nStory, Plot, Misunderstandings and Tropes: 3/6 \nPathos & Production: 1/2 \nWould watch again?: 0/1 \nOverall: 7/10 \nActual: 7.5/10\n\nThe ratings don't match the drama...\n\nThis was a pretty disappointing watch. I was very excited to finally sit down and watch this drama, but it definitely did not live up to the hype I was expecting it to.\n\nTDramas have a certain style to them, but the story is what truly makes or breaks it - and what makes it feel draggy or unnecessarily dramatic. This plot felt interesting at first, but it could've been done in 18 episodes based on how the writers wanted it to go. I didn't like how short the time was for the characters to actually be together in the \"real\" world, nor did I like how much time was spent on the melodrama portion of the story. I liked the back and forth between the two worlds, but there were so many things that could've been added / removed to make it much more interesting.\n\nThe only plus side was the chemistry and scenes between our characters, but other than that I didn't appreciate what the writers did with a seemingly decent plot.\n\nWatch if you're willing to skip around! :p"
 },
 {
   "Name": "Love is Sweet",
   "Rating": 9,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "10/23/2020",
   "Date Completed": "10/30/2020",
   "Review": ""
 },
 {
   "Name": "Love Me If You Dare",
   "Rating": 10,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "03/18/2020",
   "Date Completed": "03/31/2020",
   "Review": ""
 },
 {
   "Name": "Love O2O",
   "Rating": 8,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "12/29/2018",
   "Review": ""
 },
 {
   "Name": "Love Scenery",
   "Rating": 10,
   "Romance & Chemistry": 2,
   "Story & Plot": 5,
   "Pathos & Production": 2,
   "Date Started": "05/07/2021",
   "Date Completed": "05/18/2021",
   "Review": "Romance: 2/2 \nStory, Plot, Misunderstandings and Tropes: 5/6 \nPathos: 2/2 Would watch again?: 1/1 \nOverall: 9/10 \nActual: 10/10\n\nThe writers did their job WELL!\n\nThis drama was extremely well written and produced. The pacing of the episodes was near perfect, and the quality was top notch. Definitely going in the books as an excellent drama for 2021.\n\nI must say, LIN YI HAS IMPROVED SO MUCH. The romance scenes in this drama are light years ahead of PYHOMS. I was shocked at the upgrade! Lala Xu did a great job as well, and I absolutely loved their chemistry.\n\nThe plot was also excellent - as I said before, the pacing of the episodes was near perfect. There weren't any plot-breaking tropes thrown in, which made the drama so much more enjoyable. I loved the in game scenes and how much screen time the main couple was given. The comedic moments in the show helped with the flow as well.\n\nThere are quite a bit of unrealistic situations in this show based on the characters professions, (famous singer that can roam around freely anywhere???) but it's tolerable.\n\nThe one major con to the show was the SML. I laughed every time he appeared on screen to help me deal with how frustrating his character was. How is someone who's near 50 going to have a chance with our FL? Oh wait, he didn't. But yet he tried so hard to interfere with her business. Nobody asked you to! I am glad that his screen time was somewhat limited as the episodes went on, or I might've given this show a lower score.\n\nThat comment aside, I really enjoyed this one, and I think you will too!"
 },
 {
   "Name": "Love The Way You Are",
   "Rating": 10,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "03/09/2020",
   "Date Completed": "03/23/2020",
   "Review": ""
 },
 {
   "Name": "Lovely Us",
   "Rating": 10,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "10/31/2020",
   "Date Completed": "11/12/2020",
   "Review": ""
 },
 {
   "Name": "Lucky's First Love",
   "Rating": 8.5,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "11/3/2019",
   "Review": ""
 },
 {
   "Name": "Maiden Holmes",
   "Rating": 8.5,
   "Romance & Chemistry": 2,
   "Story & Plot": 4.5,
   "Pathos & Production": 1.5,
   "Date Started": "11/17/2020",
   "Date Completed": "11/26/2020",
   "Review": "Romance: 2/2\nStory, Plot, Misunderstandings and Tropes: 4.5/6 (rounded)\nPathos: 1.5/2\nWould watch again?: 0/1\nOverall: 8/10\nActual: 8.5/10\n\nDecent story, EXCELLENT ROMANCE, but could've been executed better\n\nDon't get me wrong, this was one of the best costume dramas I'd seen since TROTR. The chemistry was off the charts, the kissing scenes were so natural, and the plot was really nice.\n\nI felt like something was missing though, which is why it didn't get a 10/10. It felt like a drama stuck between trying to be dark and mysterious but was failing at it.\n\nBesides that, I loved the plot. Not a trope or misunderstanding in sight, and it was well rounded overall. The ML and FL were dedicated to each other, and none of the typical attempted break-ups happened. I really liked it for that."
 },
 {
   "Name": "Meteor Garden",
   "Rating": 10,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "07/11/2018",
   "Date Completed": "08/31/2018",
   "Review": ""
 },
 {
   "Name": "Meteor Garden",
   "Rating": 9,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "08/17/2019",
   "Review": ""
 },
 {
   "Name": "Miss in Kiss",
   "Rating": 8.5,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "06/03/2019",
   "Review": ""
 },
 {
   "Name": "My Girl",
   "Rating": 8,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "07/19/2020",
   "Date Completed": "07/30/2020",
   "Review": ""
 },
 {
   "Name": "My Girlfriend is an Alien",
   "Rating": 7,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "05/26/2020",
   "Review": ""
 },
 {
   "Name": "My Huckleberry Friends",
   "Rating": 10,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "02/17/2019",
   "Review": ""
 },
 {
   "Name": "My Little Happiness",
   "Rating": 10,
   "Romance & Chemistry": 2,
   "Story & Plot": 6,
   "Pathos & Production": 2,
   "Date Started": "02/18/2021",
   "Date Completed": "03/01/2021",
   "Review": "Romance: 2/2\nStory, Plot, Misunderstandings and Tropes: 6/6\nPathos: 2/2\nWould watch again?: 1/1\nOverall: 10/10\nActual: 10/10\n\nA RARE 10/10!\n\nUsually when I watch dramas, if they score high it's because of the actors/actresses and the fact that I can overlook the plot flaws just because I'm watching people I like on TV.\n\nI was a huge PYHOMS fan, and when I saw that Daddi Tang and Xing Fei were paired up I immediately laughed and said \"how could I ever watch this...\".\n\nThe first few episodes were a little awkward for me because of my loyalty to PYHOMS, but slowly I came around to this pairing. And now I think I like My Little Happiness more than PYHOMS. Here's why:\n\nThe chemistry and romance for both couples was impeccable. I never see such well matched chemistry and I'm not sure I will ever again. The characters were so natural with each other - at times you forgot that it was acting! And there were tons of kissing scenes (which was a bonus haha) I especially liked the second couple - something I rarely pay attention to in dramas - and they carried out their roles so well. I found myself secretly rooting for them on the side the whole time! And our second female lead - Zhou Chengcheng - I usually don't like seeing those types in plots, but she carried out the character so well that I couldn't find any way to dislike her. The FL's cousin was also a great secondary character. I was laughing the whole time - there were so many comedic scenes and they were executed so well and naturally.\n\nProduction and plot was off the charts in this drama - Tencent spent big money and it shows... From the hospital set to the wedding, everything was just... wow. Editing didn't feel awkward, and I didn't press the fast forward button once. I truly, truly appreciated how the writers did not have our leads break up - a very rare find in drama land. Instead, they acted like adults and worked their issues out.\n\nDefinitely give this one a watch."
 },
 {
   "Name": "My Little Princess",
   "Rating": 8,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "11/18/2018",
   "Review": ""
 },
 {
   "Name": "My Love, Enlighten Me",
   "Rating": 9,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "07/17/2020",
   "Review": ""
 },
 {
   "Name": "My Mr. Mermaid",
   "Rating": 9.5,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "03/24/2019",
   "Review": ""
 },
 {
   "Name": "My Sunshine",
   "Rating": 7.5,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "06/26/2020",
   "Review": ""
 },
 {
   "Name": "My Youth",
   "Rating": 10,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "08/31/2019",
   "Date Completed": "08/31/2019",
   "Review": ""
 },
 {
   "Name": "Perfect and Casual",
   "Rating": 10,
   "Romance & Chemistry": 2,
   "Story & Plot": 5,
   "Pathos & Production": 2,
   "Date Started": "12/19/2020",
   "Date Completed": "12/22/2020",
   "Review": "Romance: 2/2\nStory, Plot, Misunderstandings and Tropes: 5/6\nPathos: 2/2\nWould watch again?: 1/1\nOverall: 9/10 (10/10 for WWA)\n\nThe filler fluffy drama you're looking for!\n\nThis drama didn't have a lot of things happen in it - don't get me wrong, it's a rare find in the C-Drama world!\n\nI appreciated the chemistry and the characters more than the story. There were some elements that I think it would have been fine without (i.e. the \"dumb and innocent\" FL trope), but overall the story was smooth and had little to no bumps.\n\nI love how there were no major misunderstandings, and when there was a chance of one, the characters cleared it up almost immediately. On top of that, the chemistry and naturalness of the actors and actresses was immaculate. Xu Ruo Han surprised me - the girl can act! She did so well in her breakout role. I can't wait to see what she does next!\n\nWould definitely recommend this one if you're looking for some fluffiness to fill your time!"
 },
 {
   "Name": "Put Your Head on My Shoulder",
   "Rating": 10,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "05/26/2019",
   "Review": ""
 },
 {
   "Name": "Skate Into Love",
   "Rating": 9.5,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "04/13/2020",
   "Date Completed": "04/20/2020",
   "Review": ""
 },
 {
   "Name": "Someday or One Day",
   "Rating": 10,
   "Romance & Chemistry": 2,
   "Story & Plot": 6,
   "Pathos & Production": 2,
   "Date Started": "12/23/2020",
   "Date Completed": "12/26/2020",
   "Review": "Romance: 2/2\nStory, Plot, Misunderstandings and Tropes: 6/6 (rounded)\nPathos: 2/2\nWould watch again?: 1/1 (It was just so sad. I will probably watch it again, but if I can't bear to, I'll never forget it.)\nOverall: 10/10\n\nThe Best TDrama. Ever.\n\nI don't think I'll ever get over this drama. I cried for hours after I completed it. I do not see how another drama can top the emotional grasp that Someday or One Day has on its viewers. I give my outmost respect to the countless people who worked on this drama to bring it to where it was.\n\nSomeday or One Day leaves you with the sense that something was left behind, or something is missing - yet you're satisfied with the ending. That void is what makes you cry, but it's also what makes you smile - knowing that in the end, no one experienced the pain of loss as they had before.\n\nThe viewer is left alone with the story, and that's what hurts the most - only you will remember. That is something I have never seen nor believe I will experience again with a drama. That makes me cry even more - I'm the only one who will remember their story. And trust me, you want to remember as well.\n\nThis drama has taught me something important - that although the current you cannot change the past or go back to it, present you can change your future. Please give it a try so you can see just how true this is."
 },
 {
   "Name": "Somewhere Only We Know",
   "Rating": 7.5,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "06/22/2019",
   "Date Completed": "07/04/2019",
   "Review": ""
 },
 {
   "Name": "The Big Boss",
   "Rating": 8.5,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "10/08/2019",
   "Review": ""
 },
 {
   "Name": "The Fox's Summer",
   "Rating": 8.5,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "03/30/2019",
   "Review": ""
 },
 {
   "Name": "The Love Equations",
   "Rating": 8.5,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "05/12/2020",
   "Review": ""
 },
 {
   "Name": "The Romance of Tiger and Rose",
   "Rating": 10,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "09/14/2020",
   "Date Completed": "09/18/2020",
   "Review": ""
 },
 {
   "Name": "The Whirlwind Girl",
   "Rating": 7,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "04/29/2019",
   "Review": ""
 },
 {
   "Name": "Triad Princess",
   "Rating": 9,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "02/17/2020",
   "Date Completed": "02/18/2020",
   "Review": ""
 },
 {
   "Name": "Unrequited Love",
   "Rating": 8.5,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "07/25/2019",
   "Date Completed": "07/26/2019",
   "Review": ""
 },
 {
   "Name": "Well-Intended Love",
   "Rating": 8,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "05/30/2019",
   "Review": ""
 },
 {
   "Name": "When We Were Young",
   "Rating": 10,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "03/10/2019",
   "Review": ""
 },
 {
   "Name": "With You",
   "Rating": 9,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "07/26/2019",
   "Review": ""
 },
 {
   "Name": "You Are My Hero",
   "Rating": 10,
   "Romance & Chemistry": 2,
   "Story & Plot": 6,
   "Pathos & Production": 2,
   "Date Started": "03/18/2021",
   "Date Completed": "04/09/2021",
   "Review": "Romance: 2/2 \nStory, Plot, Misunderstandings and Tropes: 6/6 \nPathos: 2/2 \nWould watch again?: 1/1\nOverall: 10/10 \nActual: 10/10\n\nA DRAMA THAT LET'S CHARACTERS BE NORMAL? A GENUINE 10/10 IN MY BOOK!\n\nWow, this drama never failed to amaze... From beginning to end, it was entertaining, cute, and made you gasp for the characters at times. I remember sitting back and thinking from time to time \"THEY LET THEM RESOLVE THAT ISSUE NORMALLY? NO BREAK UP, NO RUNNING AWAY? LIKE NORMAL PEOPLE?\" - I've been so scarred by tropey dramas I thought my eyes were deceiving me.\n\nI REALLY, REALLY appreciate the writers for this one - they finally figured out how to write up a story that lets a FL defend herself, allows the couple to be together the entire time, and keeps open communication between characters at all times. What a rare find!\n\nWhat I like about this drama is that it almost tricks you into thinking they'll follow one of the many drama tropes we know, (sickness that leads to breakup or dishonesty, an evil female / male lead that tries to break the main cp up, family members that object the relationship, workmates that start crushing on our leads, misunderstandings that break characters up, etc.) but they don't! They quickly move past their problems and their relationship is so much stronger - just like people in real life do.\n\nI love the main couple too, Bai Jing Ting and Sandra Ma did a wonderful job as Xing Kelei and Mi Ka. Their relationship is exactly as it should be - great communication, always trying to be honest with each other, EXCELLENT CHEMISTRY, and very understanding of each other... Even when it might be hard. I liked the incorporation of their fields and it was exciting to watch the characters in action. The second couple took a while to finally get together, but I was rooting for them the whole time! (And they were the CUTEST) Also AGH, the second male lead (Shu Wen Bo / Cheng Hao), someone give this man a main lead!\n\nThis drama was a definite 10/10, I don't see why you're not starting it now!"
 },
 {
   "Name": "Youth",
   "Rating": 10,
   "Romance & Chemistry": null,
   "Story & Plot": null,
   "Pathos & Production": null,
   "Date Started": "",
   "Date Completed": "03/12/2020",
   "Review": ""
 }
]